package com.noirix.homework1;

public class Task10 {
    /*Напишите программу с тремя переменными целого типа,
     первым двум присвойте значения, а третьей переменной присвойте их сумму.
     Выведете значение третей переменной на экран*/
    public static void main(String[] args) {
        int a=3;
        int b=5;
        int c=a+b;
        System.out.println("sum="+c);

    }


}
