package com.noirix.homework1;

public class Task13 {
    /*Напишите программу, где двум строковым переменным присваиваются значения,
    третей же строковой переменных присвойте объединение (конкатенацию) двух предыдущих строк.
    Затем напечатайте значение третьей строковой переменной.    */
    public static void main(String[] args) {
        String s1 = "В году ";
        String s2 = "12 месяцев";
        String s=s1+s2;
        System.out.println(s);
    }
}
